redis_bench_result/get_1024_6450.log
2023-11-21 23:22:57
====== GET ======
  4000000 requests completed in 23.15 seconds
  32 parallel clients
  1024 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.16% <= 0.2 milliseconds
1.43% <= 0.3 milliseconds
5.41% <= 0.4 milliseconds
9.86% <= 0.5 milliseconds
14.48% <= 0.6 milliseconds
20.40% <= 0.7 milliseconds
27.69% <= 0.8 milliseconds
35.95% <= 0.9 milliseconds
44.50% <= 1.0 milliseconds
52.31% <= 1.1 milliseconds
58.92% <= 1.2 milliseconds
64.49% <= 1.3 milliseconds
69.16% <= 1.4 milliseconds
73.16% <= 1.5 milliseconds
76.58% <= 1.6 milliseconds
79.60% <= 1.7 milliseconds
82.27% <= 1.8 milliseconds
84.55% <= 1.9 milliseconds
86.48% <= 2 milliseconds
95.33% <= 3 milliseconds
98.12% <= 4 milliseconds
99.09% <= 5 milliseconds
99.53% <= 6 milliseconds
99.79% <= 7 milliseconds
99.89% <= 8 milliseconds
99.94% <= 9 milliseconds
99.96% <= 10 milliseconds
99.97% <= 11 milliseconds
99.99% <= 12 milliseconds
99.99% <= 13 milliseconds
99.99% <= 16 milliseconds
99.99% <= 17 milliseconds
100.00% <= 17 milliseconds
172756.33 requests per second