redis_bench_result/get_1024_6475.log
2023-11-21 23:22:57
====== GET ======
  4000008 requests completed in 23.03 seconds
  32 parallel clients
  1024 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.14% <= 0.2 milliseconds
1.44% <= 0.3 milliseconds
5.23% <= 0.4 milliseconds
10.21% <= 0.5 milliseconds
15.26% <= 0.6 milliseconds
21.31% <= 0.7 milliseconds
28.51% <= 0.8 milliseconds
36.66% <= 0.9 milliseconds
45.12% <= 1.0 milliseconds
52.94% <= 1.1 milliseconds
59.73% <= 1.2 milliseconds
65.34% <= 1.3 milliseconds
69.95% <= 1.4 milliseconds
73.78% <= 1.5 milliseconds
77.09% <= 1.6 milliseconds
80.01% <= 1.7 milliseconds
82.55% <= 1.8 milliseconds
84.70% <= 1.9 milliseconds
86.49% <= 2 milliseconds
95.43% <= 3 milliseconds
97.93% <= 4 milliseconds
99.06% <= 5 milliseconds
99.52% <= 6 milliseconds
99.75% <= 7 milliseconds
99.85% <= 8 milliseconds
99.90% <= 9 milliseconds
99.96% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 12 milliseconds
173686.84 requests per second