redis_bench_result/get_128_6486.log
2023-11-24 03:24:26
====== GET ======
  4000000 requests completed in 18.23 seconds
  16 parallel clients
  128 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.64% <= 0.1 milliseconds
17.11% <= 0.2 milliseconds
37.26% <= 0.3 milliseconds
55.19% <= 0.4 milliseconds
68.00% <= 0.5 milliseconds
75.63% <= 0.6 milliseconds
81.16% <= 0.7 milliseconds
85.32% <= 0.8 milliseconds
88.51% <= 0.9 milliseconds
90.79% <= 1.0 milliseconds
92.48% <= 1.1 milliseconds
93.83% <= 1.2 milliseconds
94.90% <= 1.3 milliseconds
95.72% <= 1.4 milliseconds
96.40% <= 1.5 milliseconds
96.95% <= 1.6 milliseconds
97.40% <= 1.7 milliseconds
97.77% <= 1.8 milliseconds
98.06% <= 1.9 milliseconds
98.31% <= 2 milliseconds
99.65% <= 3 milliseconds
99.92% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 9 milliseconds
219406.50 requests per second