redis_bench_result/get_16_6430.log
2023-11-24 03:14:25
====== GET ======
  20000008 requests completed in 90.98 seconds
  16 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.63% <= 0.1 milliseconds
17.23% <= 0.2 milliseconds
38.21% <= 0.3 milliseconds
56.02% <= 0.4 milliseconds
68.05% <= 0.5 milliseconds
75.57% <= 0.6 milliseconds
81.17% <= 0.7 milliseconds
85.32% <= 0.8 milliseconds
88.38% <= 0.9 milliseconds
90.70% <= 1.0 milliseconds
92.45% <= 1.1 milliseconds
93.78% <= 1.2 milliseconds
94.85% <= 1.3 milliseconds
95.71% <= 1.4 milliseconds
96.40% <= 1.5 milliseconds
96.94% <= 1.6 milliseconds
97.39% <= 1.7 milliseconds
97.76% <= 1.8 milliseconds
98.08% <= 1.9 milliseconds
98.35% <= 2 milliseconds
99.63% <= 3 milliseconds
99.91% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 12 milliseconds
100.00% <= 12 milliseconds
219838.30 requests per second