redis_bench_result/get_16_6451.log
2023-11-24 03:14:25
====== GET ======
  20000000 requests completed in 91.11 seconds
  16 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.57% <= 0.1 milliseconds
16.92% <= 0.2 milliseconds
37.75% <= 0.3 milliseconds
55.88% <= 0.4 milliseconds
68.05% <= 0.5 milliseconds
75.53% <= 0.6 milliseconds
81.15% <= 0.7 milliseconds
85.27% <= 0.8 milliseconds
88.33% <= 0.9 milliseconds
90.64% <= 1.0 milliseconds
92.40% <= 1.1 milliseconds
93.77% <= 1.2 milliseconds
94.86% <= 1.3 milliseconds
95.71% <= 1.4 milliseconds
96.37% <= 1.5 milliseconds
96.90% <= 1.6 milliseconds
97.36% <= 1.7 milliseconds
97.75% <= 1.8 milliseconds
98.07% <= 1.9 milliseconds
98.36% <= 2 milliseconds
99.64% <= 3 milliseconds
99.92% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 11 milliseconds
100.00% <= 11 milliseconds
219522.09 requests per second