redis_bench_result/get_16_6499.log
2023-11-21 22:40:53
====== GET ======
  20000000 requests completed in 88.07 seconds
  32 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.81% <= 0.2 milliseconds
6.00% <= 0.3 milliseconds
15.04% <= 0.4 milliseconds
23.90% <= 0.5 milliseconds
33.83% <= 0.6 milliseconds
44.08% <= 0.7 milliseconds
53.41% <= 0.8 milliseconds
61.20% <= 0.9 milliseconds
67.63% <= 1.0 milliseconds
72.86% <= 1.1 milliseconds
77.03% <= 1.2 milliseconds
80.42% <= 1.3 milliseconds
83.27% <= 1.4 milliseconds
85.63% <= 1.5 milliseconds
87.58% <= 1.6 milliseconds
89.22% <= 1.7 milliseconds
90.57% <= 1.8 milliseconds
91.69% <= 1.9 milliseconds
92.65% <= 2 milliseconds
97.58% <= 3 milliseconds
99.10% <= 4 milliseconds
99.66% <= 5 milliseconds
99.86% <= 6 milliseconds
99.95% <= 7 milliseconds
99.98% <= 8 milliseconds
99.99% <= 9 milliseconds
99.99% <= 10 milliseconds
99.99% <= 11 milliseconds
99.99% <= 12 milliseconds
99.99% <= 13 milliseconds
100.00% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 20 milliseconds
100.00% <= 27 milliseconds
100.00% <= 27 milliseconds
227084.36 requests per second