redis_bench_result/get_16_6505.log
2023-11-24 03:14:26
====== GET ======
  20000008 requests completed in 90.89 seconds
  16 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.85% <= 0.1 milliseconds
17.40% <= 0.2 milliseconds
38.29% <= 0.3 milliseconds
56.28% <= 0.4 milliseconds
68.22% <= 0.5 milliseconds
75.65% <= 0.6 milliseconds
81.25% <= 0.7 milliseconds
85.39% <= 0.8 milliseconds
88.44% <= 0.9 milliseconds
90.72% <= 1.0 milliseconds
92.45% <= 1.1 milliseconds
93.77% <= 1.2 milliseconds
94.80% <= 1.3 milliseconds
95.63% <= 1.4 milliseconds
96.30% <= 1.5 milliseconds
96.83% <= 1.6 milliseconds
97.29% <= 1.7 milliseconds
97.67% <= 1.8 milliseconds
98.00% <= 1.9 milliseconds
98.28% <= 2 milliseconds
99.63% <= 3 milliseconds
99.89% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
220043.88 requests per second