redis_bench_result/get_16_6506.log
2023-11-24 03:14:26
====== GET ======
  20000016 requests completed in 90.75 seconds
  16 parallel clients
  16 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.85% <= 0.1 milliseconds
17.68% <= 0.2 milliseconds
38.57% <= 0.3 milliseconds
56.29% <= 0.4 milliseconds
68.06% <= 0.5 milliseconds
75.49% <= 0.6 milliseconds
81.12% <= 0.7 milliseconds
85.26% <= 0.8 milliseconds
88.32% <= 0.9 milliseconds
90.66% <= 1.0 milliseconds
92.43% <= 1.1 milliseconds
93.78% <= 1.2 milliseconds
94.83% <= 1.3 milliseconds
95.67% <= 1.4 milliseconds
96.36% <= 1.5 milliseconds
96.91% <= 1.6 milliseconds
97.37% <= 1.7 milliseconds
97.75% <= 1.8 milliseconds
98.08% <= 1.9 milliseconds
98.37% <= 2 milliseconds
99.64% <= 3 milliseconds
99.91% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
220395.56 requests per second