redis_bench_result/get_256_6423.log
2023-11-21 23:03:03
====== GET ======
  12000032 requests completed in 64.37 seconds
  32 parallel clients
  256 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.42% <= 0.2 milliseconds
2.86% <= 0.3 milliseconds
8.19% <= 0.4 milliseconds
13.78% <= 0.5 milliseconds
20.36% <= 0.6 milliseconds
28.42% <= 0.7 milliseconds
37.59% <= 0.8 milliseconds
46.58% <= 0.9 milliseconds
54.60% <= 1.0 milliseconds
61.24% <= 1.1 milliseconds
66.67% <= 1.2 milliseconds
71.19% <= 1.3 milliseconds
75.03% <= 1.4 milliseconds
78.24% <= 1.5 milliseconds
80.94% <= 1.6 milliseconds
83.20% <= 1.7 milliseconds
85.14% <= 1.8 milliseconds
86.76% <= 1.9 milliseconds
88.13% <= 2 milliseconds
95.03% <= 3 milliseconds
97.53% <= 4 milliseconds
98.73% <= 5 milliseconds
99.32% <= 6 milliseconds
99.62% <= 7 milliseconds
99.78% <= 8 milliseconds
99.87% <= 9 milliseconds
99.92% <= 10 milliseconds
99.95% <= 11 milliseconds
99.97% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 17 milliseconds
100.00% <= 17 milliseconds
186419.84 requests per second