redis_bench_result/get_64_6408.log
2023-11-21 22:51:14
====== GET ======
  20000056 requests completed in 94.33 seconds
  32 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.67% <= 0.2 milliseconds
4.23% <= 0.3 milliseconds
10.90% <= 0.4 milliseconds
17.55% <= 0.5 milliseconds
25.47% <= 0.6 milliseconds
34.91% <= 0.7 milliseconds
45.00% <= 0.8 milliseconds
54.35% <= 0.9 milliseconds
62.32% <= 1.0 milliseconds
68.89% <= 1.1 milliseconds
74.15% <= 1.2 milliseconds
78.26% <= 1.3 milliseconds
81.56% <= 1.4 milliseconds
84.22% <= 1.5 milliseconds
86.40% <= 1.6 milliseconds
88.18% <= 1.7 milliseconds
89.65% <= 1.8 milliseconds
90.88% <= 1.9 milliseconds
91.91% <= 2 milliseconds
97.20% <= 3 milliseconds
98.88% <= 4 milliseconds
99.53% <= 5 milliseconds
99.77% <= 6 milliseconds
99.88% <= 7 milliseconds
99.93% <= 8 milliseconds
99.96% <= 9 milliseconds
99.98% <= 10 milliseconds
99.99% <= 11 milliseconds
99.99% <= 12 milliseconds
99.99% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 19 milliseconds
212013.23 requests per second