redis_bench_result/get_64_6418.log
2023-11-24 03:21:53
====== GET ======
  20000000 requests completed in 100.49 seconds
  16 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.39% <= 0.1 milliseconds
11.18% <= 0.2 milliseconds
27.06% <= 0.3 milliseconds
45.40% <= 0.4 milliseconds
61.22% <= 0.5 milliseconds
71.23% <= 0.6 milliseconds
78.02% <= 0.7 milliseconds
83.07% <= 0.8 milliseconds
86.73% <= 0.9 milliseconds
89.37% <= 1.0 milliseconds
91.30% <= 1.1 milliseconds
92.75% <= 1.2 milliseconds
93.88% <= 1.3 milliseconds
94.79% <= 1.4 milliseconds
95.54% <= 1.5 milliseconds
96.18% <= 1.6 milliseconds
96.70% <= 1.7 milliseconds
97.14% <= 1.8 milliseconds
97.53% <= 1.9 milliseconds
97.87% <= 2 milliseconds
99.48% <= 3 milliseconds
99.85% <= 4 milliseconds
99.95% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 12 milliseconds
199032.70 requests per second