redis_bench_result/get_64_6485.log
2023-11-24 03:21:53
====== GET ======
  20000008 requests completed in 100.42 seconds
  16 parallel clients
  64 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.18% <= 0.1 milliseconds
10.69% <= 0.2 milliseconds
26.84% <= 0.3 milliseconds
45.08% <= 0.4 milliseconds
61.41% <= 0.5 milliseconds
71.68% <= 0.6 milliseconds
78.40% <= 0.7 milliseconds
83.42% <= 0.8 milliseconds
87.07% <= 0.9 milliseconds
89.66% <= 1.0 milliseconds
91.54% <= 1.1 milliseconds
92.97% <= 1.2 milliseconds
94.09% <= 1.3 milliseconds
94.98% <= 1.4 milliseconds
95.71% <= 1.5 milliseconds
96.32% <= 1.6 milliseconds
96.82% <= 1.7 milliseconds
97.25% <= 1.8 milliseconds
97.62% <= 1.9 milliseconds
97.94% <= 2 milliseconds
99.46% <= 3 milliseconds
99.85% <= 4 milliseconds
99.96% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 18 milliseconds
100.00% <= 18 milliseconds
199165.58 requests per second