redis_bench_result/set_1024_6433.log
2023-11-21 23:22:13
====== SET ======
  4000040 requests completed in 24.58 seconds
  32 parallel clients
  1024 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: no

0.00% <= 0.1 milliseconds
0.06% <= 0.2 milliseconds
1.38% <= 0.3 milliseconds
5.07% <= 0.4 milliseconds
10.07% <= 0.5 milliseconds
14.84% <= 0.6 milliseconds
19.72% <= 0.7 milliseconds
25.41% <= 0.8 milliseconds
32.09% <= 0.9 milliseconds
39.49% <= 1.0 milliseconds
47.01% <= 1.1 milliseconds
54.09% <= 1.2 milliseconds
60.50% <= 1.3 milliseconds
66.13% <= 1.4 milliseconds
70.93% <= 1.5 milliseconds
74.87% <= 1.6 milliseconds
78.11% <= 1.7 milliseconds
80.75% <= 1.8 milliseconds
82.96% <= 1.9 milliseconds
84.84% <= 2 milliseconds
94.16% <= 3 milliseconds
97.39% <= 4 milliseconds
98.62% <= 5 milliseconds
99.21% <= 6 milliseconds
99.52% <= 7 milliseconds
99.68% <= 8 milliseconds
99.78% <= 9 milliseconds
99.85% <= 10 milliseconds
99.90% <= 11 milliseconds
99.93% <= 12 milliseconds
99.95% <= 13 milliseconds
99.98% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 15 milliseconds
162722.31 requests per second